protocols/immunofluorescence_staining.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-07-09 Thu 17:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Immunofluorescence Staining with OCT Tissue</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Immunofluorescence Staining with OCT Tissue</h1>

<div id="outline-container-orgfed86fc" class="outline-2">
<h2 id="orgfed86fc">Overview</h2>
<div class="outline-text-2" id="text-orgfed86fc">
<p>
This protocol describes indirect immunofluorescence staining of
PFA-fixed, OCT-embedded frozen tissue sections (validated on
mouse kidney).
</p>
</div>
</div>

<div id="outline-container-org1cfb7bf" class="outline-2">
<h2 id="org1cfb7bf">Safety notes</h2>
<div class="outline-text-2" id="text-org1cfb7bf">
<ul class="org-ul">
<li>Acetone is volatile and flammable; fix slides in a fume hood or
well-ventilated area, away from open flame.</li>
<li>Sudan Black B is a suspected carcinogen and an irritant; handle
with gloves and prepare/apply in a fume hood.</li>
</ul>
</div>
</div>

<div id="outline-container-org82544d4" class="outline-2">
<h2 id="org82544d4">Materials/Equipment</h2>
<div class="outline-text-2" id="text-org82544d4">
<ul class="org-ul">
<li>Humidified chamber</li>
<li>Hydrophobic barrier pen</li>
<li>Coplin jars or slide staining dishes</li>
<li>Fume hood (for acetone fixation and Sudan Black step)</li>
</ul>
</div>
</div>

<div id="outline-container-org0f30511" class="outline-2">
<h2 id="org0f30511">Reagents</h2>
<div class="outline-text-2" id="text-org0f30511">
<ol class="org-ol">
<li>Acetone (-20°C)</li>
<li>Phosphate-buffered saline (PBS)</li>
<li>Blocking buffer: 1x PBS with 5% goat serum and 2% BSA</li>
<li>Sudan Black B (0.05% in 70% ethanol) — filter before use to
remove precipitate; light-sensitive, store protected from light.</li>
<li>DAPI (Invitrogen Cat#D1306)</li>
</ol>
</div>
</div>

<div id="outline-container-org51860a0" class="outline-2">
<h2 id="org51860a0">Procedures</h2>
<div class="outline-text-2" id="text-org51860a0">
<ol class="org-ol">
<li>Remove slides from storage (-80°C) and allow to warm to room
temperature for 5 min.</li>
<li>Fix the slides in -20°C acetone. Incubate for 10 min, then air dry
until the acetone has fully evaporated.</li>
<li>Wash the slides twice in 1x PBS, 5 min each.</li>
<li>Dry the area around the tissue and apply a ring of hydrophobic
barrier. Allow the barrier to dry for 1 min.</li>
<li>Block the slides with blocking buffer. Incubate in a humidified
chamber for 1 hour.
<ul class="org-ul">
<li>Use about 100 μL per kidney section.</li>
<li>Decant the blocking buffer after 1 hour.</li>
</ul></li>
<li>Without washing, apply diluted primary antibody to the tissue.
<ul class="org-ul">
<li>Incubate in a humidified chamber at 4°C overnight.</li>
<li>Protect from light if using conjugated antibodies.</li>
<li>Need about 50 μL per mouse kidney section.</li>
</ul></li>
<li>Decant primary antibody solution.</li>
<li>Wash with 1x PBS two times, 5 min each.</li>
<li>Apply diluted secondary antibody. Incubate 1 hour at room
temperature in a humidified chamber, protected from light.
<ul class="org-ul">
<li>Secondary antibodies are usually used at 1:500 dilution.</li>
</ul></li>
<li>Wash with 1x PBS three times, 5 min each, protected from light.</li>
<li>Optional: DAPI staining
<ul class="org-ul">
<li>The mounting media contains DAPI, but additional staining may
produce more uniform DAPI signal.</li>
<li>Stock solution: 1 mg/mL (2.86 mM) in DI/MQ water.</li>
<li>Dilute 2.86 mM stock to 300 μM: 31.47 μL DAPI + 268.53 μL PBS.</li>
<li>Dilute the 300 μM intermediate solution 1:1000 in PBS to achieve
1x working concentration.</li>
<li>Incubate for 5 min, protected from light.</li>
<li>Wash with 1x PBS twice, 5 min each, before proceeding.</li>
</ul></li>
<li>Block endogenous autofluorescence with 0.05% Sudan Black B diluted
in 70% EtOH. Incubate for 10 minutes at room temperature,
protected from light.</li>
<li>Wash slides twice with DI water, 10 min each.</li>
<li>Mount and seal slides.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdb37023" class="outline-2">
<h2 id="orgdb37023">Tips and troubleshooting</h2>
<div class="outline-text-2" id="text-orgdb37023">
<ol class="org-ol">
<li><p>
Antibody dilution information
</p>

<p>
Specificity abbreviations: H = human, M = mouse, R = rat.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Antibody</th>
<th scope="col" class="org-left">Company</th>
<th scope="col" class="org-left">Cat#</th>
<th scope="col" class="org-left">Host</th>
<th scope="col" class="org-left">Clone</th>
<th scope="col" class="org-left">Specificity</th>
<th scope="col" class="org-left">Conjugation</th>
<th scope="col" class="org-left">StockConc(mg/ml)</th>
<th scope="col" class="org-left">WorkConc(ug/ml)</th>
<th scope="col" class="org-right">Dilution</th>
<th scope="col" class="org-left">Note</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Anti-Actin, α-SmoothMuscle</td>
<td class="org-left">Sigma</td>
<td class="org-left">C6198</td>
<td class="org-left">Mouse</td>
<td class="org-left">1A4</td>
<td class="org-left">HMR</td>
<td class="org-left">Cy3</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:2000</td>
<td class="org-left">1 hour RT incubation</td>
</tr>

<tr>
<td class="org-left">Anti-GFP</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab290</td>
<td class="org-left">Rabbit</td>
<td class="org-left">Polyclonal</td>
<td class="org-left">N/A</td>
<td class="org-left">None</td>
<td class="org-left">5</td>
<td class="org-left">N/A</td>
<td class="org-right">1:200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-GFP</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab6673</td>
<td class="org-left">Goat</td>
<td class="org-left">Polyclonal</td>
<td class="org-left">N/A</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:500</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-GFP</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab6662</td>
<td class="org-left">Goat</td>
<td class="org-left">Polyclonal</td>
<td class="org-left">N/A</td>
<td class="org-left">FITC</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-tdTomato</td>
<td class="org-left">Kerafast</td>
<td class="org-left">EST203</td>
<td class="org-left">Rat</td>
<td class="org-left">EST203</td>
<td class="org-left">N/A</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:200</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-mCherry</td>
<td class="org-left">Invitrogen</td>
<td class="org-left">MA5-14524</td>
<td class="org-left">Rat</td>
<td class="org-left">16D7</td>
<td class="org-left">N/A</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:100</td>
<td class="org-left">Cross-reacts with tdTomato</td>
</tr>

<tr>
<td class="org-left">Anti-CD3</td>
<td class="org-left">ProteinTech</td>
<td class="org-left">17617-1-AP</td>
<td class="org-left">Rabbit</td>
<td class="org-left">Polyclonal</td>
<td class="org-left">HMR</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:100</td>
<td class="org-left">Works well; requires antigen retrieval</td>
</tr>

<tr>
<td class="org-left">Anti-CD4</td>
<td class="org-left">Invitrogen</td>
<td class="org-left">14-9766-82</td>
<td class="org-left">Rat</td>
<td class="org-left">4SM95</td>
<td class="org-left">HM</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:100</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-CD4</td>
<td class="org-left">Biolegend</td>
<td class="org-left">100401</td>
<td class="org-left">Rat</td>
<td class="org-left">GK1.5</td>
<td class="org-left">M</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:25</td>
<td class="org-left">Ref: PMID 36092510</td>
</tr>

<tr>
<td class="org-left">Anti-GLUT1</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab115730</td>
<td class="org-left">Rabbit</td>
<td class="org-left">EPR3915</td>
<td class="org-left">HMR</td>
<td class="org-left">None</td>
<td class="org-left">0.161</td>
<td class="org-left">1</td>
<td class="org-right">1:160</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-CD68</td>
<td class="org-left">BioRad</td>
<td class="org-left">MCA1957</td>
<td class="org-left">Rat</td>
<td class="org-left">FA-11</td>
<td class="org-left">Mouse</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:50</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-F4/80</td>
<td class="org-left">BioRad</td>
<td class="org-left">MCA497</td>
<td class="org-left">Rat</td>
<td class="org-left">Cl:A3-1</td>
<td class="org-left">Mouse</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:100</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-C5b-9</td>
<td class="org-left">Santa Cruz</td>
<td class="org-left">sc-58935</td>
<td class="org-left">Mouse</td>
<td class="org-left">aE11</td>
<td class="org-left">Human, porcine</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:75</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-HIF1a</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab179483</td>
<td class="org-left">Rabbit</td>
<td class="org-left">EPR16897</td>
<td class="org-left">HMR</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:500</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-PKM2</td>
<td class="org-left">CST</td>
<td class="org-left">#4053</td>
<td class="org-left">Rabbit</td>
<td class="org-left">N/A</td>
<td class="org-left">HMR</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:100</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-Cxcr7</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab72100</td>
<td class="org-left">Rabbit</td>
<td class="org-left">N/A</td>
<td class="org-left">HM</td>
<td class="org-left">None</td>
<td class="org-left">1</td>
<td class="org-left">10</td>
<td class="org-right">1:100</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Anti-Dnmt1</td>
<td class="org-left">Abcam</td>
<td class="org-left">ab188453</td>
<td class="org-left">Rabbit</td>
<td class="org-left">EPR18453</td>
<td class="org-left">HMR</td>
<td class="org-left">None</td>
<td class="org-left">N/A</td>
<td class="org-left">N/A</td>
<td class="org-right">1:200</td>
<td class="org-left">Works well for cells; does not seem to work for tissue</td>
</tr>
</tbody>
</table></li>

<li>Always include a negative control when possible.
<ul class="org-ul">
<li>Pick the sample expected to have positive signal (i.e., an
isotype or secondary-only control run alongside a known-positive
tissue).</li>
</ul></li>
<li>When applying liquid, avoid pipetting directly onto the tissue, as
this may cause detachment. Instead, slowly pipet the liquid along
the side of the tissue section.</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last built: 2026-07-09 Thu 17:55</p>
</div>
</body>
</html>
